Masmiseim36/nxpSDK/boards/frdmk22f/wifi_qca_examples/qca_demo/pin_mux.h
/*
 * Copyright 2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTD4 (number 61), CS
  @{ */
#define BOARD_INITGT202SHIELD_RF_CS_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITGT202SHIELD_RF_CS_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                               /* @} */

/*! @name PORTD5 (number 62), SCK
  @{ */
#define BOARD_INITGT202SHIELD_LEDRGB_BLUE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITGT202SHIELD_LEDRGB_BLUE_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                                     /* @} */

/*! @name PORTC6 (number 51), IRQ
  @{ */
#define BOARD_INITGT202SHIELD_IRQ_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITGT202SHIELD_IRQ_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITGT202SHIELD_IRQ_PIN 6U     /*!<@brief PORTC pin index: 6 */
                                             /* @} */

/*! @name PORTB19 (number 42), PWRON
  @{ */
#define BOARD_INITGT202SHIELD_PWRON_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITGT202SHIELD_PWRON_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITGT202SHIELD_PWRON_PIN 19U    /*!<@brief PORTB pin index: 19 */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGT202Shield(void);

/*! @name PORTD4 (number 61), CS
  @{ */
#define BOARD_INITSILEX2401SHIELD_RF_CS_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITSILEX2401SHIELD_RF_CS_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                                   /* @} */

/*! @name PORTD5 (number 62), SCK
  @{ */
#define BOARD_INITSILEX2401SHIELD_LEDRGB_BLUE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITSILEX2401SHIELD_LEDRGB_BLUE_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                                         /* @} */

/*! @name PORTB16 (number 39), IRQ
  @{ */
#define BOARD_INITSILEX2401SHIELD_IRQ_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITSILEX2401SHIELD_IRQ_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITSILEX2401SHIELD_IRQ_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                                 /* @} */

/*! @name PORTA4 (number 26), PWRON
  @{ */
#define BOARD_INITSILEX2401SHIELD_PWRON_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITSILEX2401SHIELD_PWRON_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITSILEX2401SHIELD_PWRON_PIN 4U     /*!<@brief PORTA pin index: 4 */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSilex2401Shield(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
